Repository: Swara345565/ROSP-OnionShare
Catalog: docs/source/locale/*/LC_MESSAGES/develop.po
Languages: ga

source: Developing OnionShare
ga: OnionShare a Fhorbairt

source: Collaborating
ga: Ag comhoibriú

source: OnionShare has an open Keybase team to discuss the project, ask questions, share ideas and designs, and making plans for future development. (It's also an easy way to send end-to-end encrypted direct messages to others in the OnionShare community, like OnionShare addresses.) To use Keybase, download the `Keybase app <https://keybase.io/download>`_, make an account, and `join this team <https://keybase.io/team/onionshare>`_. Within the app, go to "Teams", click "Join a Team", and type "onionshare".
ga: Tá foireann Keybase oscailte ag OnionShare chun an tionscadal a phlé, ceisteanna a chur, smaointe agus dearaí a roinnt, agus pleananna a dhéanamh le haghaidh forbartha sa todhchaí. (Is bealach éasca é freisin chun teachtaireachtaí díreacha criptithe deireadh go deireadh a sheoladh chuig daoine eile sa phobal OnionShare, cosúil le seoltaí OnionShare.) Chun Keybase a úsáid, íoslódáil an app `Keybase <https://keybase.io/download>`_ , déan cuntas, agus `bí isteach san fhoireann seo <https://keybase.io/team/onionshare>`_. Laistigh den app, téigh go dtí "Foirne", cliceáil "Join a Team", agus cineál "onionshare".

source: OnionShare also has a `mailing list <https://lists.riseup.net/www/subscribe/onionshare-dev>`_ for developers and and designers to discuss the project.
ga: Tá `liosta seoltaí <https://lists.riseup.net/www/subscribe/onionshare-dev>`_ ag OnionShare freisin d'fhorbróirí agus do dhearthóirí chun an tionscadal a phlé.

source: Contributing Code
ga: Cód Ranníocaíochta

source: OnionShare source code is to be found in this Git repository: https://github.com/onionshare/onionshare
ga: Tá cód foinse OnionShare le fáil sa stór Git seo: https://github.com/onionshare/onionshare

source: If you'd like to contribute code to OnionShare, it helps to join the Keybase team and ask questions about what you're thinking of working on. You should also review all of the `open issues <https://github.com/onionshare/onionshare/issues>`_ on GitHub to see if there are any you'd like to tackle.
ga: Más mian leat cód a chur le OnionShare, cabhraíonn sé le bheith ar fhoireann Keybase agus ceisteanna a chur faoi na rudaí a bhfuil tú ag smaoineamh ar oibriú air. Ba cheart duit athbhreithniú a dhéanamh freisin ar na `saincheisteanna oscailte ar fad <https://github.com/onionshare/onionshare/issues>`_ ar GitHub féachaint an bhfuil aon cheann ar mhaith leat dul i ngleic leo.

source: When you're ready to contribute code, open a pull request in the GitHub repository and one of the project maintainers will review it and possibly ask questions, request changes, reject it, or merge it into the project.
ga: Nuair a bheidh tú réidh le cód a chur leis, oscail iarratas tarraingthe i stór GitHub agus déanfaidh duine de chothabhálaithe an tionscadail é a athbhreithniú agus b'fhéidir ceisteanna a chur, athruithe a iarraidh, é a dhiúltú, nó cumasc isteach sa tionscadal é.

source: Starting Development
ga: Forbairt Tosaigh

source: OnionShare is developed in Python. To get started, clone the Git repository at https://github.com/onionshare/onionshare/ and then consult the ``cli/README.md`` file to learn how to set up your development environment for the command-line version, and the ``desktop/README.md`` file to learn how to set up your development environment for the graphical version.
ga: Forbraítear OnionShare i Python. Chun tús a chur leis, clónáil stór Git ag https://github.com/onionshare/onionshare/ agus ansin féach ar an gcomhad ``cli/README.md`` chun foghlaim conas do thimpeallacht forbartha a shocrú don leagan ordú-líne , agus an comhad ``desktop/README.md`` chun foghlaim conas do thimpeallacht forbartha a shocrú don leagan grafach.

source: Those files contain the necessary technical instructions and commands install dependencies for your platform, and to run OnionShare from the source tree.
ga: Sna comhaid sin tá na treoracha agus na horduithe teicniúla is gá a shuiteáil spleáchais do d'ardán, agus chun OnionShare a rith ón gcrann foinse.

source: Debugging tips
ga: Leideanna dífhabhtaithe

source: Verbose mode
ga: Modh briathra

source: When developing, it's convenient to run OnionShare from a terminal and add the ``--verbose`` (or ``-v``) flag to the command. This prints a lot of helpful messages to the terminal, such as when certain objects are initialized, when events occur (like buttons clicked, settings saved or reloaded), and other debug info. For example::
ga: Agus é á fhorbairt, tá sé áisiúil OnionShare a rith ó chríochfort agus an bhratach ``--verbose`` (nó `` -v``) a chur leis an ordú. Priontálann sé seo go leor teachtaireachtaí cabhrach chuig an teirminéal, mar shampla nuair a chuirtear tús le rudaí áirithe, nuair a tharlaíonn imeachtaí (cosúil le cnaipí a chliceáiltear, sábháladh nó athlódáiltear socruithe), agus faisnéis dífhabhtaithe eile. Mar shampla::

source: You can add your own debug messages by running the ``Common.log`` method from ``onionshare/common.py``. For example::
ga: Is féidir leat do chuid teachtaireachtaí dífhabhtaithe féin a chur leis tríd an modh ``Common.log`` a rith ó ``onionshare/common.py``. Mar shampla::

source: This can be useful when learning the chain of events that occur when using OnionShare, or the value of certain variables before and after they are manipulated.
ga: Is féidir é seo a bheith úsáideach agus tú ag foghlaim an tslabhra imeachtaí a tharlaíonn agus OnionShare á n-úsáid, nó luach athróg áirithe roimh agus tar éis iad a láimhseáil.

source: Local Only
ga: Áitiúil amháin

source: Tor is slow, and it's often convenient to skip starting onion services altogether during development. You can do this with the ``--local-only`` flag. For example::
ga: Tá Tor mall, agus is minic a bhíonn sé áisiúil tús a chur le seirbhísí oinniúin go hiomlán le linn na forbartha. Is féidir leat é seo a dhéanamh leis an mbratach ``--áitiúil-amháin``. Mar shampla::

source: In this case, you load the URL ``http://127.0.0.1:17641`` in a normal web-browser like Firefox, instead of using the Tor Browser. The private key is not actually needed in local-only mode, so you can ignore it.
ga: Sa chás seo, luchtaíonn tú an URL ``http://127.0.0.1:17641`` i ngnáthbhrabhsálaí mar Firefox, in ionad Brabhsálaí Tor a úsáid. Níl an eochair phríobháideach ag teastáil i mód áitiúil amháin, mar sin is féidir leat neamhaird a dhéanamh di.

source: Contributing Translations
ga: Ag Cur Aistriúcháin

source: Help make OnionShare easier to use and more familiar and welcoming for people by translating it on `Hosted Weblate <https://hosted.weblate.org/projects/onionshare/>`_. Always keep the "OnionShare" in latin letters, and use "OnionShare (localname)" if needed.
ga: Cuidigh le OnionShare a dhéanamh níos fusa le húsáid agus níos eolach agus fáilteach do dhaoine trí é a aistriú ar `Hosted Weblate <https://hosted.weblate.org/projects/onionshare/>`_. Coinnigh an "OnionShare" i litreacha Laidine i gcónaí, agus úsáid "OnionShare (ainm áitiúil)" más gá.

source: To help translate, make a Hosted Weblate account and start contributing.
ga: Chun cabhrú leis an aistriúchán, déan cuntas Óstáil Weblate agus cuir tús le rannchuidiú.

source: Suggestions for Original English Strings
ga: Moltaí maidir le Bunteaghráin Bhéarla

source: Sometimes the original English strings are wrong, or don't match between the application and the documentation.
ga: Uaireanta bíonn na teaghráin bhunaidh Bhéarla mícheart, nó ní réitíonn siad idir an t-iarratas agus an doiciméadú.

source: File source string improvements by adding @kingu to your Weblate comment, or open a GitHub issue or pull request. The latter ensures all upstream developers see the suggestion, and can potentially modify the string via the usual code review processes.
ga: Feabhsuithe ar theaghrán foinse an chomhaid trí @kingu a chur le do nóta tráchta Weblate, nó eisiúint GitHub nó iarratas tarraingthe a oscailt. Cinntíonn an dara ceann go bhfeiceann gach forbróir réamhtheachtacha an moladh, agus go bhféadfaidh siad an teaghrán a mhodhnú trí na gnáthphróisis athbhreithnithe cóid.

source: Status of Translations
ga: Stádas an Aistriúcháin

source: Here is the current translation status. If you want start a translation in a language not yet started, please write to the mailing list: onionshare-dev@lists.riseup.net
ga: Seo é stádas reatha an aistriúcháin. Más mian leat aistriúchán a thosú i dteanga nach bhfuil tosaithe fós, scríobh chuig an liosta seoltaí le do thoil: onionshare-dev@lists.riseup.net
