Repository: Swara345565/ROSP-OnionShare
Catalog: docs/source/locale/*/LC_MESSAGES/install.po
Languages: bg, ga

source: If you want to learn more about verifying PGP signatures, the guides for `Qubes OS <https://www.qubes-os.org/security/verifying-signatures/>`_ and the `Tor Project <https://support.torproject.org/tbb/how-to-verify-signature/>`_ may be useful.
bg: Ако искате да научите повече за проверката на подписи с PGP, ръководствата за `Qubes OS <https://www.qubes-os.org/security/verifying-signatures/>`_ и `Tor Project <https://support.torproject.org/tbb/how-to-verify-signature/>`_ могат да ви бъдат полезни.
ga: Más mian leat tuilleadh a fhoghlaim faoi shínithe PGP a fhíorú, tá na treoracha le haghaidh `Qubes OS < https://www.qubes-os.org/security/verifying-signatures/>`_ agus an `Tor Project <https://support .torproject.org/tbb/how-to-verify-signature/> D’fhéadfadh `_ a bheith úsáideach.

source: Testflight: https://testflight.apple.com/join/ZCJeY65W
ga: Eitiltí tástála: https://testflight.apple.com/join/ZCJeY65W
