Repository: Swara345565/ROSP-OnionShare
Catalog: docs/source/locale/*/LC_MESSAGES/install.po
Languages: bg, ga

source: Installation
bg: Инсталиране
ga: Suiteáil

source: Windows or macOS
bg: Windows или macOS
ga: Windows nó macOS

source: You can download OnionShare for Windows and macOS from the `OnionShare website <https://onionshare.org/>`_.
bg: Изтеглете OnionShare за Windows и macOS от `страницата на OnionShare <https://onionshare.org/>`_.
ga: Is féidir leat OnionShare do Windows agus macOS a íoslódáil ó shuíomh Gréasáin `OnionShare <https://onionshare.org/>`_.

source: Mobile
bg: Мобилно
ga: Soghluaiste

source: You can download OnionShare for Mobile from the follow links
bg: Можете да изтеглите OnionShare за мобилни платформи от следните места
ga: Is féidir leat OnionShare for Mobile a íoslódáil ó na naisc seo a leanas

source: Android
bg: Андроид

source: Direct IPA download: https://github.com/onionshare/onionshare-ios/releases
bg: Директно изтегляне на IPA: https://github.com/onionshare/onionshare-ios/releases
ga: Íoslódáil go díreach IPA: https://github.com/onionshare/onionshare-ios/releases

source: There are various ways to install OnionShare for Linux, but the recommended way is to use either the `Flatpak <https://flatpak.org/>`_ or the `Snap <https://snapcraft.io/>`_ package. Flatpak and Snapcraft ensure that you'll always use the newest version and run OnionShare inside of a sandbox.
bg: Има различни начини да инсталирате OnionShare за Linux, но препоръчителният е да използвате пакетите `Flatpak <https://flatpak.org/>`_ или `Snap <https://snapcraft.io/>`_. Flatpak и Snapcraft гарантират, че винаги ще използвате най-новото издание и OnionShare ще работи в контролирана среда.
ga: Tá bealaí éagsúla ann chun OnionShare a shuiteáil le haghaidh Linux, ach is é an bealach molta ná úsáid a bhaint as an bpacáiste `Flatpak <https://flatpak.org/>`_ nó an pacáiste `Snap <https://snapcraft.io/>`_ . Cinntíonn Flatpak agus Snapcraft go mbainfidh tú úsáid as an leagan is nua i gcónaí agus OnionShare a reáchtáil taobh istigh de bhosca gainimh.

source: Snapcraft support is built-in to Ubuntu and Fedora comes with Flatpak support, but which you use is up to you. Both work in all Linux distributions.
bg: Поддръжката за Snapcraft е вградена в Ubuntu, а Fedora идва с поддръжка за Flatpak, но изборът е изцяло ваш. И двата пакета работят във всички варианти на Linux.
ga: Tá tacaíocht Snapcraft ionsuite i Ubuntu agus tagann Fedora le tacaíocht Flatpak, ach is fút féin a úsáideann tú. Oibríonn an dá cheann i ngach dáileadh Linux.

source: **Install OnionShare using Flatpak**: https://flathub.org/apps/details/org.onionshare.OnionShare
bg: **Инсталиране на OnionShare от Flatpak**: https://flathub.org/apps/details/org.onionshare.OnionShare
ga: ** Suiteáil OnionShare ag baint úsáide as Flatpak**: https://flathub.org/apps/details/org.onionshare.OnionShare

source: **Install OnionShare using Snapcraft**: https://snapcraft.io/onionshare
bg: **Инсталиране на OnionShare от Snapcraft**: https://snapcraft.io/onionshare
ga: ** Suiteáil OnionShare ag baint úsáide as Snapcraft **: https://snapcraft.io/onionshare

source: You can also download and install PGP-signed ``.flatpak`` or ``.snap`` packages from https://onionshare.org/dist/ if you prefer.
bg: Ако предпочитате можете да изтеглите и цифрово подписани с PGP пакети на ``.flatpak`` или ``.snap`` от https://onionshare.org/dist/.
ga: Is féidir leat pacáistí ``.flatpak`` nó ``.snap`` sínithe PGP a íoslódáil agus a shuiteáil ó https://onionshare.org/dist/ más fearr leat.

source: Manual Flatpak Installation
bg: Ръчна инсталация от Flatpak
ga: Suiteáil Flatpak Lámhleabhar

source: If you'd like to install OnionShare manually with Flatpak using the PGP-signed `single-file bundle <https://docs.flatpak.org/en/latest/single-file-bundles.html>`_, you can do so like this:
bg: Ако искате да инсталирате OnionShare ръчно от Flatpak, използвайки подписания с PGP `пакет от един файл <https://docs.flatpak.org/en/latest/single-file-bundles.html>`_, можете да го направите по следния начин:
ga: Más mian leat OnionShare a shuiteáil de láimh le Flatpak ag baint úsáide as an `cuachán aonchomhad sínithe PGP <https://docs.flatpak.org/en/latest/single-file-bundles.html>`_, is féidir leat a dhéanamh mar seo:

source: Install Flatpak by following the instructions at https://flatpak.org/setup/.
bg: Инсталирайте пакета на Flatpak, следвайки инструкциите на https://flatpak.org/setup/.
ga: Suiteáil Flatpak trí na treoracha ag https://flatpak.org/setup/ a leanúint.

source: Add the Flathub repository by running ``flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo``. Even though you won't be downloading OnionShare from Flathub, OnionShare depends on some packages that are only available there.
bg: Добавете хранилището на Flathub като изпълните ``flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo``. Въпреки че няма да изтегляте OnionShare от Flathub, OnionShare зависи от някои от пакетите, които са достъпни само там.
ga: Cuir stór Flathub leis trí ``flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo`` a rith. Cé nach mbeidh OnionShare á íoslódáil agat ó Flathub, braitheann OnionShare ar roinnt pacáistí nach bhfuil ar fáil ach ann.

source: Go to https://onionshare.org/dist/, choose the latest version of OnionShare, and download the ``.flatpak`` and ``.flatpak.asc`` files.
bg: Посетете https://onionshare.org/dist/, изберете последното издание на OnionShare и изтеглете файловете ``.flatpak`` и ``.flatpak.asc``.
ga: Téigh go https://onionshare.org/dist/, roghnaigh an leagan is déanaí de OnionShare, agus íoslódáil na comhaid ``.flatpak`` agus ``.flatpak.asc``.

source: Verify the PGP signature of the ``.flatpak`` file. See :ref:`verifying_sigs` for more info.
bg: Проверете подписа с PGP на файла ``.flatpak``. За повече информация прочетете :ref:`verifying_sigs`.
ga: Fíoraigh síniú PGP an chomhaid ``.flatpak``. Féach :ref:`verifying_sigs` le haghaidh tuilleadh eolais.

source: Install the ``.flatpak`` file by running ``flatpak install OnionShare-VERSION.flatpak``. Replace ``VERSION`` with the version number of the file you downloaded.
bg: Инсталирайте файла ``.flatpak`` като изпълните ``flatpak install OnionShare-VERSION.flatpak`` като заместите ``VERSION`` с номера на изданието на изтегления файл.
ga: Suiteáil an comhad `` .flatpak`` ag rith ``flatpak install OnionShare-VERSION.flatpak``. Cuir uimhir leagain an chomhaid a d'íoslódáil tú in ionad ``VERSION``.

source: You can run OnionShare with: `flatpak run org.onionshare.OnionShare`.
bg: Стартирайте OnionShare като изпълните: `flatpak run org.onionshare.OnionShare`.
ga: Is féidir leat OnionShare a rith le: `flatpak run org.onionshare.OnionShare`.

source: Manual Snapcraft Installation
bg: Ръчна инсталация от Snapcraft
ga: Suiteáil Snapcraft Lámhleabhar

source: If you'd like to install OnionShare manually with Snapcraft using the PGP-signed Snapcraft package, you can do so like this:
bg: Ако искате да инсталирате OnionShare ръчно от Snapcraft, използвайки подписания с PGP пакет, можете да го направите по следния начин:
ga: Más mian leat OnionShare a shuiteáil de láimh le Snapcraft ag baint úsáide as an bpacáiste Snapcraft sínithe PGP, is féidir leat é seo a dhéanamh mar seo:

source: Install Snapcraft by following the instructions at https://snapcraft.io/docs/installing-snapd.
bg: Инсталирайте пакета на Snapcraft, следвайки инструкциите на https://snapcraft.io/docs/installing-snapd.
ga: Suiteáil Snapcraft trí na treoracha ag https://snapcraft.io/docs/installing-snapd a leanúint.

source: Go to https://onionshare.org/dist/, choose the latest version of OnionShare, and download the ``.snap`` and ``.snap.asc`` files.
bg: Посетете https://onionshare.org/dist/, изберете последното издание на OnionShare и изтеглете файловете ``.snap`` и ``.snap.asc``.
ga: Téigh go https://onionshare.org/dist/, roghnaigh an leagan is déanaí de OnionShare, agus íoslódáil na comhaid ``.snap`` agus ``.snap.asc``.

source: Verify the PGP signature of the ``.snap`` file. See :ref:`verifying_sigs` for more info.
bg: Проверете подписа с PGP на файла ``.snap``. За повече информация прочетете :ref:`verifying_sigs`.
ga: Fíoraigh síniú PGP an chomhaid ``.snap``. Féach :ref:`verifying_sigs` le haghaidh tuilleadh eolais.

source: Install the ``.snap`` file by running ``snap install --dangerous onionshare_VERSION_amd64.snap``. Replace ``VERSION`` with the version number of the file you downloaded. Note that you must use `--dangerous` because the package is not signed by the Snapcraft store, however you did verify its PGP signature, so you know it's legitimate.
bg: Инсталирайте файла ``.snap`` като изпълните ``snap install --dangerous onionshare_VERSION_amd64.snap`` като заместите ``VERSION`` с номера на изданието на изтегления файл. Обърнете внимание, че трябва да използвате флага `--dangerous`, защото пакетът не е подписан от магазина Snapcraft, обаче вие сте проверили подписа с PGP на файла и за това знаете, че е неподправен.
ga: Suiteáil an comhad ``.snap`` trí ``snap install --contúirteach onionshare_VERSION_amd64.snap`` a rith. Cuir uimhir leagain an chomhaid a d'íoslódáil tú in ionad ``VERSION``. Tabhair faoi deara go gcaithfidh tú `--chontúirteach` a úsáid toisc nach bhfuil an pacáiste sínithe ag an siopa Snapcraft, ach rinne tú a shíniú PGP a fhíorú, ionas go mbeidh a fhios agat go bhfuil sé dlisteanach.

source: You can run OnionShare with: `snap run onionshare`.
bg: Стартирайте OnionShare като изпълните: `snap run onionshare`.
ga: Is féidir leat OnionShare a rith le: `snap run onionshare`.

source: Command-line only
bg: Инсталиране на версия за команден ред
ga: Líne ordaithe amháin

source: You can install just the command-line version of OnionShare on any operating system using the Python package manager ``pip``. :ref:`cli` has more info.
bg: Можете да инсталирате само версията за команден ред на OnionShare за всяка операционна система с използваща на управлението на пакети ``pip``. За повече информация прочетете :ref:`cli`.
ga: Is féidir leat an leagan ordú-líne de OnionShare a shuiteáil ar aon chóras oibriúcháin ag baint úsáide as an mbainisteoir pacáiste Python `` pip``. :ref: Tá tuilleadh eolais ag `cli`.

source: Althought not being officially developed for this platform, OnionShare can also be installed on `FreeBSD <https://freebsd.org/>`_. It's available via its ports collection or as pre-built package. Should you opt to install and use OnionShare on a FreeBSD operating system, please be aware that it's **NOT** officially supported by the OnionShare project.
bg: Въпреки че официално не се разработва за тази платформа, OnionShare може също да бъде инсталиран на `FreeBSD <https://freebsd.org/>`_. Достъпен е от собствена колекция от портове или като предварително подготвен пакет. Ако решите да инсталирате и използвате OnionShare на операционната система FreeBSD, имайте предвид, че официално **НЕ** се поддържа от проекта OnionShare.
ga: Cé nach bhfuil sé á fhorbairt go hoifigiúil don ardán seo, is féidir OnionShare a shuiteáil ar `FreeBSD <https://freebsd.org/>`_. Tá sé ar fáil trína bhailiúchán poirt nó mar phacáiste réamhthógtha. Má roghnaíonn tú OnionShare a shuiteáil agus a úsáid ar chóras oibriúcháin FreeBSD, tabhair faoi deara le do thoil go bhfuil **NACH** á thacú go hoifigiúil ag an tionscadal OnionShare.

source: Though not being offered and officially maintained by the OnionShare developers, the FreeBSD packages and ports do fetch and verifies the source codes from the official OnionShare repository (or its official release packages from `PyPI <https://pypi.org/project/onionshare-cli/>`_). Should you wish to check changes related to this platform, please refer to the following resources:
bg: Въпреки че не се предлагат и официално поддържат от разработчиците на OnionShare, пакетите и портовете за FreeBSD изтеглят и проверяват изходния код от официалното хранилище на OnionShare (или от официалните пакети за издаване от `PyPI <https://pypi.org/project/onionshare-cli/>`_). Ако желаете да прегледате промените, свързани с тази платформа се обърнете към следните ресурси:
ga: Cé nach bhfuil siad á dtairiscint agus á gcothabháil go hoifigiúil ag na forbróirí OnionShare, déanann na pacáistí agus na poirt FreeBSD na cóid foinse a fháil agus a fhíorú ó stór oifigiúil OnionShare (nó a phacáistí scaoileadh oifigiúil ó `PyPI <https://pypi.org/project/onionshare -cli/>`_). Más mian leat athruithe a bhaineann leis an ardán seo a sheiceáil, féach le do thoil do na hacmhainní seo a leanas:

source: Manual pkg Installation
bg: Ръчна инсталация от pkg
ga: Suiteáil pkg láimhe

source: To install the binary package, use ``pkg install pyXY-onionshare``, with ``pyXY`` specifying the version of Python the package was built for. So, in order to install OnionShare for Python 3.9, use::
bg: За да инсталирате двоичния пакет, изпълнете ``pkg install pyXY-onionshare``, като ``pyXY`` указва версията на Python, за която е предназначен пакетът. Така че, за да инсталирате OnionShare за Python 3.9, изпълнете::
ga: Chun an pacáiste dénártha a shuiteáil, bain úsáid as `` pkg install pyXY-onionshare``, le `` pyXY`` ag sonrú an leagan de Python ar tógadh an pacáiste dó. Mar sin, chun OnionShare do Python 3.9 a shuiteáil, bain úsáid as::

source: There's also a **Command-line only** version of OnionShare available as pre-built package. Replace ``py39-onionshare`` by ``py39-onionshare-cli`` if you want to install that version.
bg: Съществува и версия на OnionShare **само за команден ред**, налична като предварително подготвен пакет. Заменете ``py39-onionshare`` с ``py39-onionshare-cli``, ако искате да инсталирате тази версия.
ga: Tá leagan ** ord-líne amháin ** de OnionShare ar fáil mar phacáiste réamh-thógtha. Cuir ``py39-onionshare-cli`` in ionad ``py39-onionshare``más mian leat an leagan sin a shuiteáil.

source: For additional information and details about the FreeBSD pre-built packages, please refer to its `official Handbook section about pkg <https://docs.freebsd.org/en/books/handbook/ports/#pkgng-intro>`_.
bg: За допълнителна информация и подробности относно предварително подготвените пакети за FreeBSD, вижте `секция в официалното Ръководство за pkg <https://docs.freebsd.org/en/books/handbook/ports/#pkgng-intro>`_.
ga: Le haghaidh tuilleadh faisnéise agus sonraí faoi na pacáistí réamhthógtha FreeBSD, féach le do thoil dá rannán `Lámhleabhar Oifigiúil faoi pkg <https://docs.freebsd.org/en/books/handbook/ports/#pkgng-intro>`_.

source: Manual port Installation
bg: Ръчна инсталация от port
ga: Suiteáil port láimhe

source: To install the FreeBSD port, change directory to the `ports collection <https://freebsd.org/ports/>`_ you must have checked out before and run the following::
bg: За да инсталирате порта за FreeBSD, преминете към директорията на `колекцията от портове <https://freebsd.org/ports/>`_, която сте извлекли предварително, и изпълнете следното::
ga: Chun an port FreeBSD a shuiteáil, athraigh an t-eolaire go dtí an `cnuasach poirt <https://freebsd.org/ports/>`_ caithfidh tú a bheith seiceáilte amach roimhe seo agus an méid seo a leanas a rith::

source: The ports collection also offers a dedicated port for the **Command-line only** version of OnionShare. Replace ``www/onionshare`` by ``www/onionshare-cli`` if you want to install that version.
bg: Колекцията от портове също предлага и отделен порт **само за команден ред** на OnionShare. Заменете ``www/onionshare`` с ``www/onionshare-cli`` ако искате да инсталирате тази версия.
ga: Tairgeann bailiúchán na gcalafort freisin port tiomnaithe don leagan **Command-line only** de OnionShare. Cuir ``www/onionshare-cli`` in ionad ``www/onionshare`` más mian leat an leagan sin a shuiteáil.

source: For additional information and details about the FreeBSD ports collection, please refer to its `official Handbook section about ports <https://docs.freebsd.org/en/books/handbook/ports/#ports-using>`_.
bg: За допълнителна информация и подробности относно колекциите от пакети за FreeBSD, вижте `секция в официалното Ръководство за портовете<https://docs.freebsd.org/en/books/handbook/ports/#ports-using>`_.
ga: Le tuilleadh faisnéise agus sonraí a fháil faoi bhailiúchán na bport FreeBSD, féach le do thoil dá rannán `Lámhleabhar Oifigiúil faoi phoirt <https://docs.freebsd.org/en/books/handbook/ports/#ports-using>`_.

source: Verifying PGP signatures
bg: Проверка на подписите на PGP
ga: Sínithe PGP á bhfíorú

source: You can verify that the package you download is legitimate and hasn't been tampered with by verifying its PGP signature. For Windows and macOS, this step is optional and provides defense in depth: the OnionShare binaries include operating system-specific signatures, and you can just rely on those alone if you'd like.
bg: Можете сами да се уверите в целостта на изтегления файл като проверите цифровия му подпис на PGP. За Windows и macOS тази стъпка не е задължителна, но дава допълнителна сигурност, тъй като двоичните файлове на OnionShare съдържат специални за тези операционни системи цифрови подписи. Можете да разчитате и само на тях.
ga: Is féidir leat a fhíorú go bhfuil an pacáiste a íoslódálann tú dlisteanach agus nár cuireadh isteach air trína shíniú PGP a fhíorú. I gcás Windows agus macOS, tá an chéim seo roghnach agus soláthraíonn sé cosaint dhomhain: cuimsíonn na binaries OnionShare sínithe a bhaineann go sonrach le córais oibriúcháin, agus is féidir leat brath orthu sin amháin más mian leat.

source: Signing key
bg: Ключ за подписи
ga: Eochair sínithe

source: Packages are signed by the core developer who is responsible for the particular release. Following are the informations of the core developers of OnionShare:
bg: Покетите са подписани от основния разработчик, който отговаря за конкретното издание. По-долу е дадена информация за основните разработчици на OnionShare:
ga: Síníonn an príomhfhorbróir atá freagrach as an scaoileadh ar leith na pacáistí. Seo a leanas faisnéis na bhforbróirí lárnacha OnionShare:

source: Micah Lee:
bg: Майка Лий:

source: PGP public key fingerprint ``927F419D7EC82C2F149C1BD1403C2657CD994F73``.
bg: Отпечатък от публичния ключ на PGP ``927F419D7EC82C2F149C1BD1403C2657CD994F73``.
ga: Méarloirg eochair phoiblí PGP ``927F419D7EC82C2F149C1BD1403C2657CD994F73``.

source: You can download Micah's key `from the keys.openpgp.org keyserver <https://keys.openpgp.org/vks/v1/by-fingerprint/927F419D7EC82C2F149C1BD1403C2657CD994F73>`_.
bg: Можете да изтеглите ключа на Майка `от сървъра за ключове на keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/927F419D7EC82C2F149C1BD1403C2657CD994F73>`_.
ga: Is féidir leat eochair Mhicah `ó fhreastalaí eochracha keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/927F419D7EC82C2F149C1BD1403C2657CD994F73>`_.

source: Saptak Sengupta:
bg: Саптак Сенгупта:

source: PGP public key fingerprint ``2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B``.
bg: Отпечатък от публичния ключ на PGP ``2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B``.
ga: Méarloirg eochair phoiblí PGP ``2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B``.

source: You can download Saptak's key `from the keys.openpgp.org keyserver <https://keys.openpgp.org/vks/v1/by-fingerprint/2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B>`_.
bg: Можете да изтеглите ключа на Саптак `от сървъра за ключове на keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B>`_.
ga: Is féidir leat eochair Saptak `a íoslódáil ón bhfreastalaí eochracha keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B>`_.

source: You must have GnuPG installed to verify signatures. For macOS you probably want `GPGTools <https://gpgtools.org/>`_, and for Windows you probably want `Gpg4win <https://www.gpg4win.org/>`_.
bg: За да проверявате цифрови подписи трябва да имате инсталирано приложението GnuPG. За macOS е препоръчително `GPGTools <https://gpgtools.org/>`_, а за Windows – `Gpg4win <https://www.gpg4win.org/>`_.
ga: Ní mór GnuPG a bheith suiteáilte agat chun sínithe a fhíorú. Maidir le macOS is dócha gur mhaith leat `GPGTools <https://gpgtools.org/>`_, agus le haghaidh Windows is dócha go dteastaíonn `Gpg4win <https://www.gpg4win.org/>`_.

source: Signatures
bg: Подписи
ga: Sínithe

source: You can find the signatures (as ``.asc`` files), as well as Windows, macOS, Flatpak, Snap, and source packages, at https://onionshare.org/dist/ in the folders named for each version of OnionShare. You can also find them on the `GitHub Releases page <https://github.com/onionshare/onionshare/releases>`_.
bg: Можете да намерите подписите (като файлове с разширение ``.asc``), както и пакети за Windows, macOS, Flatpak, Snap и изходен код на адрес https://onionshare.org/dist/ в папки, именувани за всяко издание на OnionShare. Можете също така да ги намерите на страницата с ` издания в GitHub <https://github.com/onionshare/onionshare/releases>`_.
ga: Is féidir leat na sínithe a fháil (mar chomhaid ``.asc``), chomh maith le Windows, macOS, Flatpak, Snap, agus pacáistí foinse, ag https://onionshare.org/dist/ sna fillteáin ainmnithe do gach leagan de OinniúnShare. Is féidir leat iad a fháil freisin ar an leathanach `GitHub Releases <https://github.com/onionshare/onionshare/releases>`_.

source: Verifying
bg: Проверяване
ga: Ag fíorú

source: Once you have imported the core developers public keys into your GnuPG keychain, downloaded the binary and ``.asc`` signature, you can verify the binary in a terminal like this:
bg: След като сте внесли публичните ключове на основните разработчици в хранилището за ключове на GnuPG, изтеглили сте двоичния файл и подписа във ``.asc`` формат, можете да проверите двоичния файл в терминал по следния начин:
ga: Nuair a bheidh eochracha poiblí na bhforbróirí lárnacha iompórtáilte isteach i do eochairshlabhra GnuPG, an síniú dénártha agus ``.asc`` a íoslódáil, is féidir leat an dénártha a fhíorú i dteirminéal mar seo:

source: For Windows::
bg: За Windows::
ga: Le haghaidh Windows::

source: For macOS::
bg: За macOS::
ga: Le haghaidh macOS ::

source: For Linux::
bg: За Linux::
ga: Le haghaidh Linux::

source: and for the source file::
bg: и за файла с изходен код::
ga: agus don chomhad foinse::

source: The expected output looks like this::
bg: Изведеното в резултат от командата би трябвало да изглежда така::
ga: Breathnaíonn an t-aschur ionchais mar seo::

source: If you don't see ``Good signature from``, there might be a problem with the integrity of the file (malicious or otherwise), and you should not install the package.
bg: Ако не виждате ``Good signature from``, може да има проблем с целостта на файла (зловреден или друг), и не трябва да инсталирате пакета.
ga: Mura bhfeiceann tú ``Síniú maith ó``, seans go mbeidh fadhb ann le sláine an chomhaid (mailíseach nó eile), agus níor cheart duit an pacáiste a shuiteáil.

source: The ``WARNING:`` shown above, is not a problem with the package, it only means you haven't defined a level of "trust" of Micah's (the core developer) PGP key.
bg: Предупреждението ``WARNING:`` по-горе не е проблем с пакета; то означава, че не сте задали ниво на „доверие“ към ключа на Майка (основния разработчик).
ga: Ní fadhb leis an bpacáiste é an `` RABHADH:`` a thaispeántar thuas, ní chiallaíonn sé ach nach bhfuil leibhéal "iontaobhais" d'eochair PGP Micah (an príomhfhorbróir) sainmhínithe agat.
