Repository: Swara345565/ROSP-OnionShare
Catalog: docs/source/locale/*/LC_MESSAGES/security.po
Languages: ar

source: Security Design
ar: تصميم الأمان

source: Read :ref:`how_it_works` first to get a handle on how OnionShare works.
ar: اقرأ :ref:`how_it_works` أولاً للتعرف على كيفية عمل OnionShare.

source: Like all software, OnionShare may contain bugs or vulnerabilities.
ar: كما هو الحال مع جميع البرامج، قد يحتوي OnionShare على أخطاء أو ثغرات أمنية.

source: What OnionShare protects against
ar: ما الذي يحميه OnionShare

source: **Third parties don't have access to anything that happens in OnionShare.** Using OnionShare means hosting services directly on your computer. When sharing your files with OnionShare, they are not uploaded to any third-party server. If you make an OnionShare chat room, your computer acts as a server for that too. This avoids the traditional model of having to trust the computers of others.
ar: ** لا تستطيع الجهات الخارجية الوصول إلى أي شيء يحدث في OnionShare. ** استخدام OnionShare يعني استضافة الخدمات مباشرة على جهاز الكمبيوتر الخاص بك. عند مشاركة ملفاتك مع OnionShare، لا يتم تحميلها إلى أي خادم تابع لجهة خارجية. إذا قمت بإنشاء غرفة دردشة OnionShare، فإن جهاز الكمبيوتر الخاص بك يعمل كخادم لذلك أيضًا. وهذا يتجنب النموذج التقليدي المتمثل في الاضطرار إلى الثقة بأجهزة كمبيوتر الآخرين.

source: **Network eavesdroppers can't spy on anything that happens in OnionShare in transit.** The connection between the Tor onion service and Tor Browser is end-to-end encrypted. This means network attackers can't eavesdrop on anything except encrypted Tor traffic. Even if an eavesdropper is a malicious rendezvous node used to connect the Tor Browser with OnionShare's onion service, the traffic is encrypted using the onion service's private key.
ar: **لا يمكن للمتنصتين على الشبكة التجسس على أي شيء يحدث في OnionShare أثناء النقل.** يتم تعمية الاتصال بين خدمة تور البصلية ومتصفح تور من البداية إلى النهاية. وهذا يعني أن مهاجمي الشبكة لا يمكنهم التنصت على أي شيء باستثناء حركة مرور تور المُعمَّاة. حتى إذا كان المتنصت عبارة عن عقدة لقاء ضارة تستخدم لتوصيل متصفح تور بخدمة OnionShare البصلية، فإن حركة المرور مُعمَّاة باستخدام المفتاح الخاص لخدمة OnionShare البصلية.

source: **Anonymity of OnionShare users are protected by Tor.** OnionShare and Tor Browser protect the anonymity of the users. As long as the OnionShare user anonymously communicates the OnionShare address with the Tor Browser users, the Tor Browser users and eavesdroppers can't learn the identity of the OnionShare user.
ar: **حماية هوية مستخدمي OnionShare تتم بواسطة تور.** يحمي OnionShare ومتصفح تور هوية المستخدمين. طالما أن مستخدم OnionShare يتواصل بشكل مجهول مع مستخدمي متصفح تور باستخدام عنوان OnionShare، فلن يتمكن مستخدمو متصفح تور والمتنصتون من معرفة هوية مستخدم OnionShare.

source: **If an attacker learns about the onion service, they still can't access anything.** Prior attacks against the Tor network to enumerate onion services allowed attackers to discover private ``.onion`` addresses. To access an OnionShare service from its address, the private key used for client authentication must be guessed (unless the service is already made public by turning off the private key -- see :ref:`turn_off_private_key`).
ar: **إذا علم المهاجم بخدمة Onion Share، فلن يتمكن من الوصول إلى أي شيء.** سمحت الهجمات السابقة ضد شبكة تور لإحصاء خدمات Onion Share للمهاجمين باكتشاف عناوين خاصة بامتداد ``.onion``. للوصول إلى خدمة OnionShare من عنوانها، يجب تخمين المفتاح الخاص المستخدم لمصادقة العميل (ما لم يتم بالفعل جعل الخدمة عامة عن طريق إيقاف تشغيل المفتاح الخاص -- راجع :ref:`turn_off_private_key`).

source: What OnionShare doesn't protect against
ar: ما لا يوفره OnionShare للحماية

source: **Communicating the OnionShare address and private key might not be secure.** Communicating the OnionShare address to people is the responsibility of the OnionShare user. If sent insecurely (such as through an e-mail message monitored by an attacker), an eavesdropper can tell that OnionShare is being used. Eavesdroppers can access services that are still up by loading their addresses and/or lost key in the Tor Browser. Avoid this by communicating the address securely, via encrypted text message (probably with disappearing messages enabled), encrypted e-mail, or in person. This isn't necessary when using OnionShare for something that isn't secret.
ar: **قد لا يكون توصيل عنوان OnionShare والمفتاح الخاص آمنًا.** إن توصيل عنوان OnionShare للأشخاص هو مسؤولية مستخدم OnionShare. إذا تم إرساله بشكل غير آمن (مثل من خلال رسالة بريد إلكتروني يراقبها مهاجم)، فيمكن للمتنصت أن يخبر أن OnionShare قيد الاستخدام. يمكن للمتنصتين الوصول إلى الخدمات التي لا تزال قيد التشغيل من خلال تحميل عناوينهم و/أو المفتاح المفقود في متصفح تور. تجنب هذا من خلال توصيل العنوان بشكل آمن، عبر رسالة نصية مُعمَّاة (ربما مع تمكين الرسائل المختفية)، أو البريد الإلكتروني المعمى، أو شخصيًا. هذا ليس ضروريًا عند استخدام OnionShare لشيء غير سري.

source: **Communicating the OnionShare address and private key might not be anonymous.** Extra precaution must be taken to ensure the OnionShare address is communicated anonymously. A new e-mail or chat account, only accessed over Tor, can be used to share the address. This isn't necessary unless anonymity is a goal.
ar: **قد لا يكون تبادل عنوان OnionShare والمفتاح الخاص مجهولاً.** يجب اتخاذ احتياطات إضافية لضمان تبادل عنوان OnionShare بشكل مجهول. يمكن استخدام حساب بريد إلكتروني أو حساب دردشة جديد، يمكن الوصول إليه عبر تور فقط، لمشاركة العنوان. هذا ليس ضروريًا إلا إذا كان الهدف هو المجهولية.
